# ------------------------------------------------------------------------------
#     Imos法
# ------------------------------------------------------------------------------
# 
# verify
# - https://atcoder.jp/contests/abc183/tasks/abc183_d
# - https://atcoder.jp/contests/abc221/tasks/abc221_d (座圧いもす)
# ------------------------------------------------------------------------------

N = 5
S = [1,2,3,4,5]
T = [4,5,6,7,8]
# テーブルの初期化
maxST = 2 * 10 ** 5
imos = [0] * (maxST + 1)
for i in range(N):
    imos[S[i]] += 1
    imos[T[i] + 1] -= 1

# ビルド
for i in range(1, len(imos)):
    imos[i] += imos[i - 1]
